In [ ]:
#Write a function parse_dataset(year) that helps you work with the data.

#The function should:

#accept a single year as input value
#construct a valid file path
#read in the corresponding names dataset
#define the correct column index for the data set
#output the dataset as a pandas dataframe

In [4]:
import pandas as pd

In [9]:
def parse_dataset(year):
    year = input(f'Please input year')
    df = pd.read_csv(f'../data/data/names/yob{year}.txt', names = ["name", "gender", "frequency"])
    return df
    
year = 1880


parse_dataset(1880)

Please input year 1880

           name gender  frequency
0          Mary      F       7065
1          Anna      F       2604
2          Emma      F       2003
3     Elizabeth      F       1939
4        Minnie      F       1746
...         ...    ...        ...
1995     Woodie      M          5
1996     Worthy      M          5
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

[2000 rows x 3 columns]